## Pandas

In [1]:
import pandas as pd

In [2]:
pd.__file__

'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\pandas\\__init__.py'

In [71]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep='\s+', header = None)

# separate는 빈 공간으로 지정 (\s: 스페이스 한 칸. 데이터와 데이터 사이 공백이 딱 한 칸. 두 칸은 \s\s.)
# \s+ 데이터와 데이터 사이 빈 공간 한 칸 이상.

df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [72]:
df_data.shape

(506, 14)

In [9]:
from pandas import Series, DataFrame
import numpy as np

# Series: Column Vector를 표현하는 object

In [75]:
list_data = [11, 12, 13, 14, 15]
example_obj = Series(data = list_data)
example_obj  # 좌측은 index, 우측은 data(values)

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [76]:
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = Series(data = list_data, index = list_name) # index name 지정
example_obj

a    11
b    12
c    13
d    14
e    15
dtype: int64

In [85]:
example_obj.index.name = "alphabet"
example_obj

alphabet
a     3.2
b    12.0
c    13.0
d    14.0
e    15.0
Name: 예시01, dtype: float64

In [86]:
example_obj = Series(data = list_data, index = list_name, dtype=np.float, name = "예시01")
example_obj

a    11.0
b    12.0
c    13.0
d    14.0
e    15.0
Name: 예시01, dtype: float64

In [87]:
example_obj['a']

11.0

In [88]:
example_obj['a'] = 3.2
example_obj

a     3.2
b    12.0
c    13.0
d    14.0
e    15.0
Name: 예시01, dtype: float64

In [83]:
example_obj.values

array([ 3.2, 12. , 13. , 14. , 15. ])

In [84]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
# 함수 쓰고 Shift + TAB: 뭐 뭐 입력해야 되는지 알 수 있다.
example_obj = Series()

In [ ]:
# Series: DataFrame 중 하나의 Column에 해당하는 데이터 모음 Object
#

In [33]:
raw_data = {
    "first_name":["Jason", "Molly", "Tina", "Jake"],
    "last_name":["Miller", "Jacobson", "Ali", "Milner"],
    "age":[42, 52, 36, 24],
    'city':['San Francisco', 'Baltimore', 'Miami', 'Douglas']
}

In [34]:
raw_data

{'first_name': ['Jason', 'Molly', 'Tina', 'Jake'],
 'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner'],
 'age': [42, 52, 36, 24],
 'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas']}

In [35]:
df = pd.DataFrame(raw_data, columns = ["first_name", "last_name", "age", "city", "debt"])
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN

In [36]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
Name: first_name, dtype: object

In [37]:
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
Name: first_name, dtype: object

In [47]:
df.debt

0    NaN
1    NaN
2    NaN
3    NaN
Name: debt, dtype: object

In [49]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False

In [43]:
df.loc[1]  # loc: index location (인덱스 이름. 번호.)

  first_name last_name  age       city debt
1      Molly  Jacobson   52  Baltimore  NaN
2       Tina       Ali   36      Miami  NaN
3       Jake    Milner   24    Douglas  NaN

In [45]:
df['age'].iloc[1:]  # iloc: index position (인덱스 넘버. 위치.)

1    52
2    36
3    24
Name: age, dtype: int64

In [51]:
index = np.arange(100, 110)
index

array([100, 101, 102, 103, 104, 105, 106, 107, 108, 109])

In [53]:
student_data = {
    "name":["홍길동", "이몽룡", "성춘향"],
    "department":["ICT 융합", "컴퓨터 공학", "국어국문"]
}

In [54]:
student = DataFrame(student_data, index = [20190101, 20190102, 20190103])
student

         name department
20190101  홍길동     ICT 융합
20190102  이몽룡     컴퓨터 공학
20190103  성춘향       국어국문

In [55]:
student.loc[20190101]

name             홍길동
department    ICT 융합
Name: 20190101, dtype: object

In [59]:
%xmode Plain

Exception reporting mode: Plain

In [60]:
student.iloc[20190101]

IndexError: single positional indexer is out-of-bounds

In [61]:
student.iloc[0]

name             홍길동
department    ICT 융합
Name: 20190101, dtype: object

In [62]:
student.loc[0]

KeyError: 'the label [0] is not in the [index]'

In [64]:
student["grade"] = np.array(["C", "D", "A"])
student

         name department grade
20190101  홍길동     ICT 융합     C
20190102  이몽룡     컴퓨터 공학     D
20190103  성춘향       국어국문     A

In [65]:
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False

In [68]:
del df["debt"]
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas

In [69]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco'],
       ['Molly', 'Jacobson', 52, 'Baltimore'],
       ['Tina', 'Ali', 36, 'Miami'],
       ['Jake', 'Milner', 24, 'Douglas']], dtype=object)

In [70]:
df.to_csv

<bound method DataFrame.to_csv of   first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas>

In [66]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [67]:
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

## selection & drop

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("./data/excel-comp-data.xlsx")

In [4]:
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [6]:
df["account"].head() # 1개 column 선택

0    211829
1    320563
2    648336
3    109996
4    121213
Name: account, dtype: int64

In [7]:
df[["account", "street", "state"]].head(3) # 1개 이상

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

In [8]:
df[:3]  # row

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [18]:
df.account

0     211829
1     320563
2     648336
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
13    268755
14    273274
Name: account, dtype: int64

In [19]:
df[df.account > 300000]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [9]:
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [21]:
df.account[[5, 8, 3]]

5    132971
8    209744
3    109996
Name: account, dtype: int64

In [22]:
df.loc[3]

account                             109996
name           D'Amore, Gleichner and Bode
street         155 Fadel Crescent Apt. 144
city                            Hyattburgh
state                                Maine
postal-code                          46021
Jan                                  45000
Feb                                 120000
Mar                                  10000
Name: 3, dtype: object

In [24]:
# account로 index 행 이름을 설정하고 싶음

df.index = df["account"]
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [26]:
del df['account']
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [32]:
df.loc[648336]

name                     Bashirian, Kunde and Price
street         62184 Schamberger Underpass Apt. 231
city                                 New Lilianland
state                                          Iowa
postal-code                                   76517
Jan                                           91000
Feb                                          120000
Mar                                           35000
Name: 648336, dtype: object

In [33]:
df.iloc[8]

name             Champlin-Morar
street         26739 Grant Lock
city            Lake Juliannton
state              Pennsylvania
postal-code               64415
Jan                       70000
Feb                       95000
Mar                       35000
Name: 209744, dtype: object

In [35]:
df.index = list(range(0, 15)) # index 재설정
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [36]:
# drop
df.drop(1) #index number로 drop

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [37]:
df.drop([0, 1, 2, 4, 5])

,name,street,city,state,postal-code,Jan,Feb,Mar
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [38]:
df.drop('city', axis=1) #axis 지정 - column 중 'city' drop

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

## dataframe operations

In [44]:
# Series operation

from pandas import Series

s1 = Series(range(1, 6), index=list('abced'))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [45]:
s2 = Series(range(5, 11), index=list('bcedef'))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [46]:
s1.add(s2)  # index 기준으로 연산 수행. 겹치는 index 없을 경우 NaN (연산 불가. null)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [47]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [ ]:
# DataFrame은 column과 index 모두 고려

In [51]:
from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.arange(9).reshape(3, 3), columns=list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [52]:
df2 = DataFrame(np.arange(16).reshape(4, 4), columns=list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [53]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [54]:
df1.add(df2)

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [55]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [74]:
# Series + DataFrame

s = Series(np.arange(10, 14), index=['a', 'b', 'c', 'd'])
s

a    10
b    11
c    12
d    13
dtype: int32

In [75]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [76]:
df2 + s   # column 기준으로 broadcasting 발생

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [77]:
df2.add(s)

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [78]:
df2.add(s, axis=0)  # row broadcasting

    a   b   c   d
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
a NaN NaN NaN NaN
b NaN NaN NaN NaN
c NaN NaN NaN NaN
d NaN NaN NaN NaN

In [79]:
sr = Series(np.arange(10, 14))
sr

0    10
1    11
2    12
3    13
dtype: int32

In [80]:
df2 + sr

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [81]:
df2.add(sr, axis=0)  # row broadcasting

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## lambda, map, apply

In [83]:
# map(function, sequence): 각 element 마다 입력 받은 함수를 적용해 list 반환

ex = [1, 2, 3, 4, 5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [96]:
s1 = Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [97]:
s1.map(lambda x: x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [98]:
s1.map({1: '일', 3: 'C', 5:'D', 4:'사'})

0    NaN
1      일
2    NaN
3      C
4      사
5      D
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [86]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [92]:
df.sex.unique()  # 유일한 값

array(['male', 'female'], dtype=object)

In [95]:
df['sex_code'] = df.sex.map({"male":0, "female":1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [100]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [102]:
df.earn.max()

317949.12795506103

In [103]:
df.earn.min()

-98.5804890739183

In [108]:
f = lambda x: x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [125]:
df_info.apply(np.std)

earn      31245.734713
height        3.816723
age          15.783988
dtype: float64

In [126]:
df_info.std()

earn      31257.070006
height        3.818108
age          15.789715
dtype: float64

In [127]:
df_info.apply(np.mean)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [134]:
df_info.mean()

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [135]:
def f(x):
    return Series([x.min(), x.max()], index=["min", "max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

In [143]:
def g(x):
    return Series([x.mean(), x.std()], index=['mean', 'std'])
df_info.apply(g)

              earn     height        age
mean  32446.292622  66.592640  45.328499
std   31257.070006   3.818108  15.789715

## pandas built-in functions

In [211]:
# unique

In [262]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [263]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [264]:
df.race.unique() # 유일한 race의 값 list

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [265]:
dict(enumerate(df['race'].unique()))  # enumerate 열거

{0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}

In [266]:
list(enumerate(df['race'].unique()))

[(0, 'white'), (1, 'other'), (2, 'hispanic'), (3, 'black')]

In [267]:
np.array(dict(enumerate(df["race"].unique())))  #dict type으로 index

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [268]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['race'].unique())),dtype=str)[:, 1].tolist()

value, key   # label index 값과 label 값 각각 추출

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [269]:
df['race'].replace(key, value, inplace=True) # .replace(to_replace=key, value=value, inplace=True)
df.head()  # label str index 값으로 변환

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

In [191]:
df.head()

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

In [200]:
# sex

In [194]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [195]:
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [196]:
list(enumerate(df['sex'].unique()))

[(0, 'male'), (1, 'female')]

In [197]:
np.array(list(enumerate(df['sex'].unique())))

array([['0', 'male'],
       ['1', 'female']], dtype='<U11')

In [198]:
np.array(list(enumerate(df['sex'].unique())))[:, 0]

array(['0', '1'], dtype='<U11')

In [202]:
np.array(list(enumerate(df['sex'].unique())))[:, 1]

array(['male', 'female'], dtype='<U11')

In [235]:
value = np.array(list(enumerate(df['sex'].unique())))[:, 0].tolist()

In [236]:
key = np.array(list(enumerate(df['sex'].unique())), dtype=str)[:, 1].tolist()

In [237]:
df['sex'].replace(to_replace=key, value=value, inplace=True)
df.head()

           earn  height sex  race  ed  age
0  79571.299011   73.89   0     0  16   49
1  96396.988643   66.23   1     0  16   62
2  48710.666947   63.77   1     0  16   33
3  80478.096153   63.22   1     1  16   95
4  82089.345498   63.08   1     0  17   43

In [238]:
# sum

In [239]:
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex                inf
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [240]:
df.sum(axis=1).head()

0    79710.189011
1    96541.218643
2    48823.436947
3    80653.316153
4    82212.425498
dtype: float64

In [241]:
# null

In [242]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

In [243]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [244]:
# sort_values
df.sort_values(['age', 'earn'], ascending=True).head(10)  #ascending: 오름차순

             earn  height sex  race  ed  age
1038   -56.321979   67.81   0     2  10   22
800    -27.876819   72.29   0     0  12   22
963    -25.655260   68.90   0     0  12   22
1105   988.565070   64.71   1     0  12   22
801   1000.221504   64.09   1     0  12   22
862   1002.023843   66.59   1     0  12   22
933   1007.994941   68.26   1     0  12   22
988   1578.542814   64.53   0     0  12   22
522   1955.168187   69.87   1     3  12   22
765   2581.870402   64.79   1     0  12   22

In [245]:
# correlation & covariance
print(df.age.corr(df.earn))
print(df.earn.corr(df.age))
print(df.age.cov(df.earn))
print(df.earn.cov(df.age))

0.07400349177836055
0.07400349177836055
36523.6992104089
36523.6992104089

In [246]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [254]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

In [253]:
df['sex'] = df['sex'].astype(int)